In [ ]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#%matplotlib inline

In [2]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [5]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [6]:
df.notnull()

       A      B     C
0   True   True  True
1   True  False  True
2  False  False  True

In [7]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [8]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df2 = df.append(pd.DataFrame([np.nan])).reset_index(drop=True)
df2

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN
2  NaN  NaN  3.0 NaN
3  NaN  NaN  NaN NaN

In [11]:
df2.dropna()

Empty DataFrame
Columns: [A, B, C, 0]
Index: []

In [29]:
df2.dropna(thresh=1, axis =0)

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN
2  NaN  NaN  3.0 NaN

In [31]:
df2.fillna(df2.mean())

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  5.0  2.0 NaN
2  1.5  5.0  3.0 NaN
3  1.5  5.0  2.0 NaN